/*
 * (C) Copyright 2018 Nexell
 * SangJong, Han <hans@nexell.co.kr>
 *
 * SPDX-License-Identifier: GPL-2.0+
 */

#include <common.h>
#include <command.h>
#include <console.h>
#include <dm.h>
#include <dm/uclass-internal.h>
#include <clk.h>
#include <usb.h>
#include <generic-phy.h>
#include <linux/io.h>

DECLARE_GLOBAL_DATA_PTR;

#define	HIGH_USB_VER			0x0200		/* 2.0 */
#define	HIGH_MAX_PKT_SIZE_EP0		64
#define	HIGH_MAX_PKT_SIZE_EP1		512		/* bulk */
#define	HIGH_MAX_PKT_SIZE_EP2		512		/* bulk */

#define	FULL_USB_VER			0x0110		/* 1.1 */
#define	FULL_MAX_PKT_SIZE_EP0		8		/* Do not modify */
#define	FULL_MAX_PKT_SIZE_EP1		64		/* bulk */
#define	FULL_MAX_PKT_SIZE_EP2		64		/* bulk */

#define RX_FIFO_SIZE			512
#define NPTX_FIFO_START_ADDR		RX_FIFO_SIZE
#define NPTX_FIFO_SIZE			512
#define PTX_FIFO_SIZE			512

#define	DEVICE_DESCRIPTOR_SIZE		(18)
#define	CONFIG_DESCRIPTOR_SIZE		(9 + 9 + 7 + 7)

/*
 * NXP3220: 0x2375, S5PXX18: 0x04e8, Samsung Vendor ID : 0x04e8
 * NXP3220: 0x3220, S5PXX18: 0x1234, Nexell Product ID : 0x1234
 */
#define VENDORID			0x2375
#define PRODUCTID			0x3220

/* SPEC1.1 */

/* configuration descriptor: bmAttributes */
enum config_attributes {
	CONF_ATTR_DEFAULT		= 0x80,
	CONF_ATTR_REMOTE_WAKEUP		= 0x20,
	CONF_ATTR_SELFPOWERED		= 0x40
};

/* endpoint descriptor */
enum endpoint_attributes {
	EP_ADDR_IN			= 0x80,
	EP_ADDR_OUT			= 0x00,
	EP_ATTR_CONTROL			= 0x00,
	EP_ATTR_ISOCHRONOUS		= 0x01,
	EP_ATTR_BULK			= 0x02,
	EP_ATTR_INTERRUPT		= 0x03
};

/* Standard bRequest codes */
enum standard_request_code {
	STANDARD_GET_STATUS		= 0,
	STANDARD_CLEAR_FEATURE		= 1,
	STANDARD_RESERVED_1		= 2,
	STANDARD_SET_FEATURE		= 3,
	STANDARD_RESERVED_2		= 4,
	STANDARD_SET_ADDRESS		= 5,
	STANDARD_GET_DESCRIPTOR		= 6,
	STANDARD_SET_DESCRIPTOR		= 7,
	STANDARD_GET_CONFIGURATION	= 8,
	STANDARD_SET_CONFIGURATION	= 9,
	STANDARD_GET_INTERFACE		= 10,
	STANDARD_SET_INTERFACE		= 11,
	STANDARD_SYNCH_FRAME		= 12
};

enum descriptortype {
	DESCRIPTORTYPE_DEVICE		= 1,
	DESCRIPTORTYPE_CONFIGURATION	= 2,
	DESCRIPTORTYPE_STRING		= 3,
	DESCRIPTORTYPE_INTERFACE	= 4,
	DESCRIPTORTYPE_ENDPOINT		= 5
};

#define CONTROL_EP			0
#define BULK_IN_EP			1
#define BULK_OUT_EP			2

/**
 * USB2.0 HS OTG
 **/
struct nx_usb_otg_gcsr_reg {
	u32 gotgctl;			/* 0x000 R/W OTG Control and Status
					   Register */
	u32 gotgint;			/* 0x004 R/W OTG Interrupt Register */
	u32 gahbcfg;			/* 0x008 R/W Core AHB Configuration
					   Register */
	u32 gusbcfg;			/* 0x00C R/W Core USB Configuration
					   Register */
	u32 grstctl;			/* 0x010 R/W Core Reset Register */
	u32 gintsts;			/* 0x014 R/W Core Interrupt Register */
	u32 gintmsk;			/* 0x018 R/W Core Interrupt Mask
					   Register */
	u32 grxstsr;			/* 0x01C R   Receive Status Debug Read
					   Register */
	u32 grxstsp;			/* 0x020 R/W Receive Status Debug Pop
					   Register */
	u32 grxfsiz;			/* 0x024 R/W Receive FIFO Size Register
					   */
	u32 gnptxfsiz;			/* 0x028 R   Non-Periodic Transmit FIFO
					   Size Register */
	u32 gnptxsts;			/* 0x02C R/W Non-Periodic Transmit
					   FIFO/Queue Status Register */
	u32 reserved0;			/* 0x030     Reserved */
	u32 reserved1;			/* 0x034     Reserved */
	u32 reserved2;			/* 0x038     Reserved */
	u32 guid;			/* 0x03C R   User ID Register */
	u32 gsnpsid;			/* 0x040 R   Synopsys ID Register */
	u32 ghwcfg1;			/* 0x044 R   User HW Config1 Register */
	u32 ghwcfg2;			/* 0x048 R   User HW Config2 Register */
	u32 ghwcfg3;			/* 0x04C R   User HW Config3 Register */
	u32 ghwcfg4;			/* 0x050 R   User HW Config4 Register */
	u32 glpmcfg;			/* 0x054 R/W Core LPM Configuration
					   Register */
	u32 reserved3[(0x100-0x058)/4];	/* 0x058 ~ 0x0FC */
	u32 hptxfsiz;			/* 0x100 R/W Host Periodic Transmit FIFO
					   Size Register */
	u32 dieptxf[15];		/* 0x104 ~ 0x13C R/W Device IN Endpoint
					   Transmit FIFO Size Register */
	u32 reserved4[(0x400-0x140)/4];	/* 0x140 ~ 0x3FC */
};

struct nx_usb_otg_host_channel_reg {
	u32 hcchar;			/* 0xn00 R/W Host Channel-n
					   Characteristics Register */
	u32 hcsplt;			/* 0xn04 R/W Host Channel-n Split
					   Control Register */
	u32 hcint;			/* 0xn08 R/W Host Channel-n Interrupt
					   Register */
	u32 hcintmsk;			/* 0xn0C R/W Host Channel-n Interrupt
					   Mask Register */
	u32 hctsiz;			/* 0xn10 R/W Host Channel-n Transfer
					   Size Register */
	u32 hcdma;			/* 0xn14 R/W Host Channel-n DMA Address
					   Register */
	u32 reserved[2];		/* 0xn18, 0xn1C Reserved */
};

struct nx_usb_otg_hmcsr_reg {
	u32 hcfg;			/* 0x400 R/W Host Configuration Register
					   */
	u32 hfir;			/* 0x404 R/W Host Frame Interval
					   Register */
	u32 hfnum;			/* 0x408 R   Host Frame Number/Frame
					   Time Remaining Register */
	u32 reserved0;			/* 0x40C     Reserved */
	u32 hptxsts;			/* 0x410 R/W Host Periodic Transmit
					   FIFO/Queue Status Register */
	u32 haint;			/* 0x414 R   Host All Channels Interrupt
					   Register */
	u32 haintmsk;			/* 0x418 R/W Host All Channels Interrupt
					   Mask Register */
	u32 reserved1[(0x440-0x41C)/4];	/* 0x41C ~ 0x43C Reserved */
	u32 hprt;			/* 0x440 R/W Host Port Control and
					   Status Register */
	u32 reserved2[(0x500-0x444)/4];	/* 0x444 ~ 0x4FC Reserved */
	struct nx_usb_otg_host_channel_reg hcc[16];/* 0x500 ~ 0x6FC */
	u32 reserved3[(0x800-0x700)/4];	/* 0x700 ~ 0x7FC */
};

struct nx_usb_otg_device_epi_reg {
	u32 diepctl;			/* 0xn00 R/W Device Control IN endpoint
					   n Control Register */
	u32 reserved0;			/* 0xn04     Reserved */
	u32 diepint;			/* 0xn08 R/W Device Endpoint-n Interrupt
					   Register */
	u32 reserved1;			/* 0xn0C     Reserved */
	u32 dieptsiz;			/* 0xn10 R/W Device Endpoint-n Transfer
					   Size Register */
	u32 diepdma;			/* 0xn14 R/W Device Endpoint-n DMA
					   Address Register */
	u32 dtxfsts;			/* 0xn18 R   Device IN Endpoint Transmit
					   FIFO Status Register */
	u32 diepdmab;			/* 0xn1C R   Device Endpoint-n DMA
					   Buffer Address Register */
};

struct nx_usb_otg_device_ep0_reg {
	u32 doepctl;			/* 0xn00 R/W Device Control OUT endpoint
					   n Control Register */
	u32 reserved0;			/* 0xn04     Reserved */
	u32 doepint;			/* 0xn08 R/W Device Endpoint-n Interrupt
					   Register */
	u32 reserved1;			/* 0xn0C     Reserved */
	u32 doeptsiz;			/* 0xn10 R/W Device Endpoint-n Transfer
					   Size Register */
	u32 doepdma;			/* 0xn14 R/W Device Endpoint-n DMA
					   Address Register */
	u32 reserved2;			/* 0xn18     Reserved */
	u32 doepdmab;			/* 0xn1C R   Device Endpoint-n DMA
					   Buffer Address Register */
};

struct nx_usb_otg_dmcsr_reg {
	u32 dcfg;			/* 0x800 R/W Device Configuration
					   Register */
	u32 dctl;			/* 0x804 R/W Device Control Register */
	u32 dsts;			/* 0x808 R   Device Status Register */
	u32 reserved0;			/* 0x80C     Reserved */
	u32 diepmsk;			/* 0x810 R/W Device IN Endpoint Common
					   Interrupt Mask Register */
	u32 doepmsk;			/* 0x814 R/W Device OUT Endpoint Common
					   Interrupt Mask Register */
	u32 daint;			/* 0x818 R   Device All Endpoints
					   Interrupt Register */
	u32 daintmsk;			/* 0x81C R/W Device All Endpoints
					   Interrupt Mask Register */
	u32 reserved1;			/* 0x820     Reserved */
	u32 reserved2;			/* 0x824     Reserved */
	u32 dvbusdis;			/* 0x828 R/W Device VBUS Discharge Time
					   Register */
	u32 dvbuspulse;			/* 0x82C R/W Device VBUS Pulsing Time
					   Register */
	u32 dthrctl;			/* 0x830 R/W Device Threshold Control
					   Register */
	u32 diepempmsk;			/* 0x834 R/W Device IN Endpoint FIFO
					   Empty Interrupt Mask Register */
	u32 reserved3;			/* 0x838     Reserved */
	u32 reserved4;			/* 0x83C     Reserved */
	u32 reserved5[0x10];		/* 0x840 ~ 0x87C    Reserved */
	u32 reserved6[0x10];		/* 0x880 ~ 0x8BC    Reserved */
	u32 reserved7[0x10];		/* 0x8C0 ~ 0x8FC    Reserved */
	struct nx_usb_otg_device_epi_reg depir[16]; /* 0x900 ~ 0xAFC */
	struct nx_usb_otg_device_ep0_reg depor[16]; /* 0xB00 ~ 0xCFC */
};

struct nx_usb_otg_reg {
	struct nx_usb_otg_gcsr_reg  gcsr;/* 0x0000 ~ 0x03FC */
	struct nx_usb_otg_hmcsr_reg hcsr;/* 0x0400 ~ 0x07FC */
	struct nx_usb_otg_dmcsr_reg dcsr;/* 0x0800 ~ 0x0CFC */
	u32 reserved0[(0xe00-0xd00)/4];	/* 0x0D00 ~ 0x0DFC	Reserved */
	u32 pcgcctl;			/* 0x0E00 R/W Power and Clock Gating
					   Control Register */
	u32 reserved1[(0x1000-0xe04)/4];/* 0x0E04 ~ 0x0FFC	Reserved */
	u32 epfifo[15][1024];		/* 0x1000 ~ 0xFFFC Endpoint Fifo */
	/*u32 epfifo[16][1024];*/	/* 0x1000 ~ 0x10FFC Endpoint Fifo */
	/*u32 reserved2[(0x20000-0x11000)/4];*//* 0x11000 ~ 0x20000 Reserved */
	/*u32 debugfifo[0x8000];*/	/* 0x20000 ~ 0x3FFFC Debug Purpose
					   Direct Fifo Acess Register */
};

/* definitions related to CSR setting */
/* USB Global Interrupt Status register(GINTSTS) setting value */
#define WKUP_INT			(1u<<31)
#define OEP_INT				(1<<19)
#define IEP_INT				(1<<18)
#define ENUM_DONE			(1<<13)
#define USB_RST				(1<<12)
#define USB_SUSP			(1<<11)
#define RXF_LVL				(1<<4)

/* NX_OTG_GOTGCTL*/
#define B_SESSION_VALID			(0x1<<19)
#define A_SESSION_VALID			(0x1<<18)

/* NX_OTG_GAHBCFG*/
#define PTXFE_HALF			(0<<8)
#define PTXFE_ZERO			(1<<8)
#define NPTXFE_HALF			(0<<7)
#define NPTXFE_ZERO			(1<<7)
#define MODE_SLAVE			(0<<5)
#define MODE_DMA			(1<<5)
#define BURST_SINGLE			(0<<1)
#define BURST_INCR			(1<<1)
#define BURST_INCR4			(3<<1)
#define BURST_INCR8			(5<<1)
#define BURST_INCR16			(7<<1)
#define GBL_INT_UNMASK			(1<<0)
#define GBL_INT_MASK			(0<<0)

/* NX_OTG_GRSTCTL*/
#define AHB_MASTER_IDLE			(1u<<31)
#define CORE_SOFT_RESET			(0x1<<0)

/* NX_OTG_GINTSTS/NX_OTG_GINTMSK core interrupt register */
#define INT_RESUME			(1u<<31)
#define INT_DISCONN			(0x1<<29)
#define INT_CONN_ID_STS_CNG		(0x1<<28)
#define INT_OUT_EP			(0x1<<19)
#define INT_IN_EP			(0x1<<18)
#define INT_ENUMDONE			(0x1<<13)
#define INT_RESET			(0x1<<12)
#define INT_SUSPEND			(0x1<<11)
#define INT_TX_FIFO_EMPTY		(0x1<<5)
#define INT_RX_FIFO_NOT_EMPTY		(0x1<<4)
#define INT_SOF				(0x1<<3)
#define INT_DEV_MODE			(0x0<<0)
#define INT_HOST_MODE			(0x1<<1)

/* NX_OTG_GRXSTSP STATUS*/
#define GLOBAL_OUT_NAK			(0x1<<17)
#define OUT_PKT_RECEIVED		(0x2<<17)
#define OUT_TRNASFER_COMPLETED		(0x3<<17)
#define SETUP_TRANSACTION_COMPLETED	(0x4<<17)
#define SETUP_PKT_RECEIVED		(0x6<<17)

/* NX_OTG_DCTL device control register */
#define NORMAL_OPERATION		(0x1<<0)
#define SOFT_DISCONNECT			(0x1<<1)

/* NX_OTG_DAINT device all endpoint interrupt register */
#define INT_IN_EP0			(0x1<<0)
#define INT_IN_EP1			(0x1<<1)
#define INT_IN_EP3			(0x1<<3)
#define INT_OUT_EP0			(0x1<<16)
#define INT_OUT_EP2			(0x1<<18)
#define INT_OUT_EP4			(0x1<<20)

/* NX_OTG_DIEPCTL0/NX_OTG_DOEPCTL0 */
#define DEPCTL_EPENA			(0x1u<<31)
#define DEPCTL_EPDIS			(0x1<<30)
#define DEPCTL_SNAK			(0x1<<27)
#define DEPCTL_CNAK			(0x1<<26)
#define DEPCTL_STALL			(0x1<<21)
#define DEPCTL_ISO_TYPE			(EP_TYPE_ISOCHRONOUS<<18)
#define DEPCTL_BULK_TYPE		(EP_TYPE_BULK<<18)
#define DEPCTL_INTR_TYPE		(EP_TYPE_INTERRUPT<<18)
#define DEPCTL_USBACTEP			(0x1<<15)

/*ep0 enable, clear nak, next ep0, max 64byte */
#define EPEN_CNAK_EP0_64 (DEPCTL_EPENA|DEPCTL_CNAK|(CONTROL_EP<<11)|(0<<0))

/*ep0 enable, clear nak, next ep0, 8byte */
#define EPEN_CNAK_EP0_8 (DEPCTL_EPENA|DEPCTL_CNAK|(CONTROL_EP<<11)|(3<<0))

/* DIEPCTLn/DOEPCTLn */
#define BACK2BACK_SETUP_RECEIVED	(0x1<<6)
#define INTKN_TXFEMP			(0x1<<4)
#define NON_ISO_IN_EP_TIMEOUT		(0x1<<3)
#define CTRL_OUT_EP_SETUP_PHASE_DONE	(0x1<<3)
#define AHB_ERROR			(0x1<<2)
#define TRANSFER_DONE			(0x1<<0)

struct nx_setup_packet {
	u8 requesttype;
	u8 request;
	u16 value;
	u16 index;
	u16 length;
};

enum usb_speed {
	USB_HIGH,
	USB_FULL,
	USB_LOW
	/*,0xFFFFFFFFUL*/
};

enum ep_type {
	EP_TYPE_CONTROL, EP_TYPE_ISOCHRONOUS, EP_TYPE_BULK, EP_TYPE_INTERRUPT
};

/* EP0 state */
enum ep0_state {
	EP0_STATE_INIT			= 0,
	EP0_STATE_GET_DSCPT		= 1,
	EP0_STATE_GET_INTERFACE		= 2,
	EP0_STATE_GET_CONFIG		= 3,
	EP0_STATE_GET_STATUS		= 4
};

struct nx_usbboot_status {
	bool		downloading;
	u8		*rx_buf_addr;
	s32		rx_size;
	u32		ep0_state;
	enum usb_speed	speed;
	u32		ctrl_max_pktsize;
	u32		bulkin_max_pktsize;
	u32		bulkout_max_pktsize;
	u8		*current_ptr;
	u32		current_fifo_size;
	u32		remain_size;
	u32		up_addr;
	u32		up_size;
	u8		*up_ptr;
	u8		cur_config;
	u8		cur_interface;
	u8		cur_setting;
	u8		reserved;
	const u8	*device_descriptor;
	const u8	*config_descriptor;
} __aligned(4);

static u8 gs_device_descriptor_fs[DEVICE_DESCRIPTOR_SIZE]
	__aligned(4) = {
	18,				/* 0 desc size */
	(u8)(DESCRIPTORTYPE_DEVICE),	/* 1 desc type (DEVICE) */
	(u8)(FULL_USB_VER % 0x100),	/* 2 USB release */
	(u8)(FULL_USB_VER / 0x100),	/* 3 => 1.00 */
	0xFF,				/* 4 class */
	0xFF,				/* 5 subclass */
	0xFF,				/* 6 protocol */
	(u8)FULL_MAX_PKT_SIZE_EP0,	/* 7 max pack size */
	(u8)(VENDORID % 0x100),		/* 8 vendor ID LSB */
	(u8)(VENDORID / 0x100),		/* 9 vendor ID MSB */
	(u8)(PRODUCTID % 0x100),	/* 10 product ID LSB
					   (second product) */
	(u8)(PRODUCTID / 0x100),	/* 11 product ID MSB */
	0x00,				/* 12 device release LSB */
	0x00,				/* 13 device release MSB */
	0x00,				/* 14 manufacturer string desc index */
	0x00,				/* 15 product string desc index */
	0x00,				/* 16 serial num string desc index */
	0x01				/* 17 num of possible configurations */
};

static u8 gs_device_descriptor_hs[DEVICE_DESCRIPTOR_SIZE]
	__aligned(4) = {
	18,				/* 0 desc size */
	(u8)(DESCRIPTORTYPE_DEVICE),	/* 1 desc type (DEVICE) */
	(u8)(HIGH_USB_VER % 0x100),	/*  2 USB release */
	(u8)(HIGH_USB_VER / 0x100),	/* 3 => 1.00 */
	0xFF,				/* 4 class */
	0xFF,				/* 5 subclass */
	0xFF,				/* 6 protocol */
	(u8)HIGH_MAX_PKT_SIZE_EP0,	/* 7 max pack size */
	(u8)(VENDORID	% 0x100),	/* 8 vendor ID LSB */
	(u8)(VENDORID	/ 0x100),	/* 9 vendor ID MSB */
	(u8)(PRODUCTID % 0x100),	/* 10 product ID LSB
					   (second product) */
	(u8)(PRODUCTID / 0x100),	/* 11 product ID MSB */
	0x00,				/* 12 device release LSB */
	0x00,				/* 13 device release MSB */
	0x00,				/* 14 manufacturer string desc index */
	0x00,				/* 15 product string desc index */
	0x00,				/* 16 serial num string desc index */
	0x01				/* 17 num of possible configurations */
};

static const u8	gs_config_descriptor_fs[CONFIG_DESCRIPTOR_SIZE]
	__aligned(4) = {
	/* Configuration Descriptor */
	0x09,					/* 0 desc size */
	(u8)(DESCRIPTORTYPE_CONFIGURATION),	/* 1 desc type (CONFIGURATION)
						 */
	(u8)(CONFIG_DESCRIPTOR_SIZE % 0x100),	/* 2 total length of data
						   returned LSB */
	(u8)(CONFIG_DESCRIPTOR_SIZE / 0x100),	/* 3 total length of data
						   returned MSB */
	0x01,					/* 4 num of interfaces */
	0x01,					/* 5 value to select config (1
						   for now) */
	0x00,					/* 6 index of string desc ( 0
						   for now) */
	CONF_ATTR_DEFAULT|CONF_ATTR_SELFPOWERED,/* 7 bus powered */
	25,					/* 8 max power, 50mA for now */

	/* Interface Decriptor */
	0x09,					/* 0 desc size */
	(u8)(DESCRIPTORTYPE_INTERFACE),		/* 1 desc type (INTERFACE) */
	0x00,					/* 2 interface index. */
	0x00,					/* 3 value for alternate setting
						   */
	0x02,					/* 4 bNumEndpoints (number
						   endpoints used, excluding
						   EP0) */
	0xFF,					/* 5 */
	0xFF,					/* 6 */
	0xFF,					/* 7 */
	0x00,					/* 8 string index, */

	/* Endpoint descriptor (EP 1 Bulk IN) */
	0x07,					/* 0 desc size */
	(u8)(DESCRIPTORTYPE_ENDPOINT),		/* 1 desc type (ENDPOINT) */
	BULK_IN_EP|EP_ADDR_IN,			/* 2 endpoint address: endpoint
						   1, IN */
	EP_ATTR_BULK,				/* 3 endpoint attributes: Bulk
						 */
	(u8)(FULL_MAX_PKT_SIZE_EP1 % 0x100),	/* 4 max packet size LSB */
	(u8)(FULL_MAX_PKT_SIZE_EP1 / 0x100),	/* 5 max packet size MSB */
	0x00,					/* 6 polling interval
						   (4ms/bit=time,500ms) */

	/* Endpoint descriptor (EP 2 Bulk OUT) */
	0x07,					/* 0 desc size */
	(u8)(DESCRIPTORTYPE_ENDPOINT),		/* 1 desc type (ENDPOINT) */
	BULK_OUT_EP|EP_ADDR_OUT,		/* 2 endpoint address: endpoint
						   2, OUT */
	EP_ATTR_BULK,				/* 3 endpoint attributes: Bulk
						 */
	(u8)(FULL_MAX_PKT_SIZE_EP2 % 0x100),	/* 4 max packet size LSB */
	(u8)(FULL_MAX_PKT_SIZE_EP2 / 0x100),	/* 5 max packet size MSB */
	0x00					/* 6 polling interval
						   (4ms/bit=time,500ms) */
};

static const u8	gs_config_descriptor_hs[CONFIG_DESCRIPTOR_SIZE]
	__aligned(4) = {
	/* Configuration Descriptor */
	0x09,					/* 0 desc size */
	(u8)(DESCRIPTORTYPE_CONFIGURATION),	/* 1 desc type (CONFIGURATION)
						 */
	(u8)(CONFIG_DESCRIPTOR_SIZE % 0x100),	/* 2 total length of data
						   returned LSB */
	(u8)(CONFIG_DESCRIPTOR_SIZE / 0x100),	/* 3 total length of data
						   returned MSB */
	0x01,					/* 4 num of interfaces */
	0x01,					/* 5 value to select config (1
						   for now) */
	0x00,					/* 6 index of string desc ( 0
						   for now) */
	CONF_ATTR_DEFAULT|CONF_ATTR_SELFPOWERED,/* 7 bus powered */
	25,					/* 8 max power, 50mA for now */

	/* Interface Decriptor */
	0x09,					/* 0 desc size */
	(u8)(DESCRIPTORTYPE_INTERFACE),		/* 1 desc type (INTERFACE) */
	0x00,					/* 2 interface index. */
	0x00,					/* 3 value for alternate setting
						   */
	0x02,					/* 4 bNumEndpoints (number
						   endpoints used, excluding
						   EP0) */
	0xFF,					/* 5 */
	0xFF,					/* 6 */
	0xFF,					/* 7 */
	0x00,					/* 8 string index, */

	/* Endpoint descriptor (EP 1 Bulk IN) */
	0x07,					/* 0 desc size */
	(u8)(DESCRIPTORTYPE_ENDPOINT),		/* 1 desc type (ENDPOINT) */
	BULK_IN_EP|EP_ADDR_IN,			/* 2 endpoint address: endpoint
						   1, IN */
	EP_ATTR_BULK,				/* 3 endpoint attributes: Bulk
						 */
	(u8)(HIGH_MAX_PKT_SIZE_EP1 % 0x100),	/* 4 max packet size LSB */
	(u8)(HIGH_MAX_PKT_SIZE_EP1 / 0x100),	/* 5 max packet size MSB */
	0x00,					/* 6 polling interval
						   (4ms/bit=time,500ms) */
	/* Endpoint descriptor (EP 2 Bulk OUT) */
	0x07,					/* 0 desc size */
	(u8)(DESCRIPTORTYPE_ENDPOINT),		/* 1 desc type (ENDPOINT) */
	BULK_OUT_EP|EP_ADDR_OUT,		/* 2 endpoint address: endpoint
						   2, OUT */
	EP_ATTR_BULK,				/* 3 endpoint attributes: Bulk
						 */
	(u8)(HIGH_MAX_PKT_SIZE_EP2 % 0x100),	/* 4 max packet size LSB */
	(u8)(HIGH_MAX_PKT_SIZE_EP2 / 0x100),	/* 5 max packet size MSB */
	0x00					/* 6 polling interval
						   (4ms/bit=time,500ms) */
};

/* @brief ECID Module's Register List */
struct nx_ecid_reg {
	u32 chipname[12];    /* 0x000 */
	u32 _rev0;            /* 0x030 */
	u32 guid[4];          /* 0x034 */
	u32 ec0;              /* 0x044 */
	u32 _rev1;            /* 0x048 */
	u32 ec2;              /* 0x04C */
	u32 blow[3];          /* 0x050 */
	u32 _rev2;            /* 0x05C */
	u32 blowd[4];         /* 0x060 */
	u32 _rev3[36];        /* 0x070 */
	u32 ecid[4];          /* 0x100 */
	u32 sbootkey0[4];     /* 0x110 */
	u32 sbootkey1[4];     /* 0x120 */
	u32 _rev4[8];         /* 0x130 */
	u32 sboothash0[8];    /* 0x150 */
	u32 _rev5[8];         /* 0x170 */
	u32 sboothash1[8];    /* 0x190 */
	u32 sboothash2[8];    /* 0x1B0 */
	u32 sjtag[4];         /* 0x1D0 */
	u32 anti_rb[4];       /* 0x1E0 */
	u32 efuse_cfg;        /* 0x1F0 */
	u32 efuse_prot;       /* 0x1F4 */
	u32 _rev6[2];         /* 0x1F8 */
	u32 boot_cfg;         /* 0x200 */
	u32 _rev7[3];         /* 0x204 */
	u32 back_enc_ek[8];   /* 0x210 */
	u32 root_enc_key[8];  /* 0x230 */
	u32 cm0_sboot_key[16];/* 0x250 */
	u32 root_priv_key[17];/* 0x290 */
	u32 _rev8[11];        /* 0x2D4 */
	u32 puf[136];         /* 0x300 */
	u32 puf_cfg;          /* 0x520 */
	u32 cm0_anti_rb;      /* 0x524 */
	u32 cm0_anti_rb_cfg;  /* 0x528 */
	u32 _rev9;            /* 0x52C */
	u32 hpm_ids[4];       /* 0x530 */
};

struct nx_usbdown_priv {
	void __iomem *reg_otg;
	void __iomem *reg_ecid;
	struct nx_usbboot_status ustatus;
	struct phy phy;
	struct clk clk;
};

static void nx_usb_get_usbid(void __iomem *ecid, u16 *vid, u16 *pid)
{
	struct nx_ecid_reg *reg = ecid;
	u32 id = readl(&reg->ecid[3]);

	if (!id) {   /* ecid is not burned */
		*vid = VENDORID;
		*pid = PRODUCTID;
		debug("\nECID Null!!\nVID %x, PID %x\n", *vid, *pid);
	} else {
		*vid = (id >> 16)&0xFFFF;
		*pid = (id >> 0)&0xFFFF;
		debug("VID %x, PID %x\n", *vid, *pid);
	}
}

static void nx_usb_write_in_fifo(struct nx_usb_otg_reg *reg_otg,
				 u32 ep, u8 *buf, s32 num)
{
	s32 i;
	u32 *dwbuf = (u32 *)buf;		/* assume all data ptr is 4
						   bytes aligned */
	for (i = 0; i < (num + 3) / 4; i++)
		writel(dwbuf[i], &reg_otg->epfifo[ep][0]);
}

static void nx_usb_read_out_fifo(struct nx_usb_otg_reg *reg_otg,
				 u32 ep, u8 *buf, s32 num)
{
	s32 i;
	u32 *dwbuf = (u32 *)buf;
